:PROPERTIES:
:ID:       46615078-5777-4487-8197-b1c6fd8641a0
:END:
#+title: PhD
#+FILETAGS: @PhD WORK
#+filetags: blockchain
#+hugo_base_dir: /home/awannaphasch2016/org/projects/sideprojects/website/my-website/hugo/quickstart


* PhD
:PROPERTIES:
:ID:       46615078-5777-4487-8197-b1c6fd8641a0
:END:
:LOGBOOK:
CLOCK: [2022-03-05 Sat 11:56]--[2022-03-05 Sat 11:57] =>  0:01
CLOCK: [2022-03-03 Thu 18:32]--[2022-03-03 Thu 18:33] =>  0:01
CLOCK: [2022-03-03 Thu 13:50]--[2022-03-03 Thu 13:51] =>  0:01
CLOCK: [2022-03-03 Thu 12:05]--[2022-03-03 Thu 12:06] =>  0:01
CLOCK: [2022-03-02 Wed 18:14]--[2022-03-02 Wed 18:15] =>  0:01
CLOCK: [2022-02-28 Mon 17:06]--[2022-02-28 Mon 17:25] =>  0:19
CLOCK: [2022-02-28 Mon 16:41]--[2022-02-28 Mon 17:06] =>  0:25
CLOCK: [2022-02-28 Mon 13:53]--[2022-02-28 Mon 16:33] =>  2:40
CLOCK: [2022-02-28 Mon 10:17]--[2022-02-28 Mon 13:53] =>  3:36
CLOCK: [2022-02-28 Mon 10:15]--[2022-02-28 Mon 10:17] =>  0:02
CLOCK: [2022-02-28 Mon 10:10]--[2022-02-28 Mon 10:12] =>  0:02
CLOCK: [2022-02-28 Mon 09:57]--[2022-02-28 Mon 10:10] =>  0:13
CLOCK: [2022-02-28 Mon 09:24]--[2022-02-28 Mon 09:57] =>  0:33
CLOCK: [2022-02-28 Mon 08:57]--[2022-02-28 Mon 09:24] =>  0:27
CLOCK: [2022-02-28 Mon 08:47]--[2022-02-28 Mon 08:55] =>  0:08
CLOCK: [2022-02-27 Sun 16:50]--[2022-02-27 Sun 16:51] =>  0:01
CLOCK: [2022-02-27 Sun 09:03]--[2022-02-27 Sun 09:04] =>  0:01
CLOCK: [2022-02-26 Sat 12:02]--[2022-02-26 Sat 12:11] =>  0:09
CLOCK: [2022-02-25 Fri 00:03]--[2022-02-25 Fri 00:04] =>  0:01
CLOCK: [2022-02-24 Thu 23:44]--[2022-02-24 Thu 23:45] =>  0:01
CLOCK: [2022-02-24 Thu 15:39]--[2022-02-24 Thu 15:46] =>  0:07
CLOCK: [2022-02-24 Thu 13:50]--[2022-02-24 Thu 13:54] =>  0:04
CLOCK: [2022-02-24 Thu 11:06]--[2022-02-24 Thu 11:07] =>  0:01
CLOCK: [2022-02-24 Thu 11:05]--[2022-02-24 Thu 11:06] =>  0:01
CLOCK: [2022-02-24 Thu 10:58]--[2022-02-24 Thu 11:04] =>  0:06
CLOCK: [2022-02-24 Thu 10:57]--[2022-02-24 Thu 10:58] =>  0:01
CLOCK: [2022-02-24 Thu 10:51]--[2022-02-24 Thu 10:53] =>  0:02
CLOCK: [2022-02-24 Thu 10:49]--[2022-02-24 Thu 10:50] =>  0:01
CLOCK: [2022-02-24 Thu 10:48]--[2022-02-24 Thu 10:49] =>  0:01
CLOCK: [2022-02-23 Wed 10:29]--[2022-02-23 Wed 10:30] =>  0:01
CLOCK: [2022-02-23 Wed 10:08]--[2022-02-23 Wed 10:28] =>  0:20
CLOCK: [2022-02-23 Wed 09:36]--[2022-02-23 Wed 10:03] =>  0:27
CLOCK: [2022-02-22 Tue 17:33]--[2022-02-22 Tue 17:35] =>  0:02
CLOCK: [2022-02-22 Tue 17:12]--[2022-02-22 Tue 17:28] =>  0:16
CLOCK: [2022-02-22 Tue 16:43]--[2022-02-22 Tue 16:57] =>  0:14
CLOCK: [2022-02-22 Tue 15:24]--[2022-02-22 Tue 16:19] =>  0:55
CLOCK: [2022-02-22 Tue 14:41]--[2022-02-22 Tue 15:23] =>  0:42
CLOCK: [2022-02-22 Tue 14:19]--[2022-02-22 Tue 14:39] =>  0:20
CLOCK: [2022-02-22 Tue 13:30]--[2022-02-22 Tue 13:55] => -1:40
CLOCK: [2022-02-22 Tue 12:59]--[2022-02-22 Tue 13:00] =>  0:01
CLOCK: [2022-02-22 Tue 09:38]--[2022-02-22 Tue 09:40] =>  0:02
CLOCK: [2022-02-22 Tue 01:22]--[2022-02-22 Tue 01:23] =>  0:01
CLOCK: [2022-02-21 Mon 22:03]--[2022-02-21 Mon 22:06] =>  0:03
CLOCK: [2022-02-21 Mon 22:01]--[2022-02-21 Mon 22:02] =>  0:01
CLOCK: [2022-02-20 Sun 22:57]--[2022-02-20 Sun 22:58] =>  0:01
CLOCK: [2022-02-20 Sun 22:56]--[2022-02-20 Sun 22:57] =>  0:01
CLOCK: [2022-02-20 Sun 22:55]--[2022-02-20 Sun 22:56] =>  0:01
CLOCK: [2022-02-20 Sun 22:52]--[2022-02-20 Sun 22:53] =>  0:01
:END:
***** TODO contact each of my advisors to explain to each of them about my PhD situations. (Why I am not making progress as I should.)
:PROPERTIES:
:ID:       2a357981-ce26-4857-a708-8320c9395bf9
:END:
:LOGBOOK:
CLOCK: [2022-04-14 Thu 19:49]--[2022-04-14 Thu 19:51] =>  0:02
:END:
[2022-04-14 Thu 19:49]
***** TODO Read about how to write Thesis for my PhD.
SCHEDULED: <2022-05-05 Thu>
:LOGBOOK:
CLOCK: [2022-02-26 Sat 10:01]--[2022-02-26 Sat 10:02] =>  0:01
:END:
[2022-02-26 Sat 10:01]
[[file:~/org/refile.org::*figure out a way to migrate content from roam research to emacs using org roam and others. What are features that I still need from roam research that may take too much time for me to implement or figure out to replicate in emacs?][figure out a way to migrate content from roam research to emacs using org roam and others. What are features that I still need from roam research that may take too much time for me to implement or figure out to replicate in emacs?]]
***** collect literature that I read related to temporal graph and start connecting the dot between content. Think of doing this as building a solid ground to recall what I know and what I can do from knowning that I know what I know. (should I do it in emacs or roam research?)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 22:50]--[2022-02-24 Thu 22:53] =>  0:03
:END:
[2022-02-24 Thu 22:50]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*domain defines all possible values for attribute.][domain defines all possible values for attribute.]]

** Writing Ensemble Approaches for Streaming Networking Classification paper
:LOGBOOK:
CLOCK: [2022-03-17 Thu 10:45]--[2022-03-17 Thu 12:51] =>  2:06
CLOCK: [2022-03-14 Mon 13:10]--[2022-03-14 Mon 13:39] =>  0:29
CLOCK: [2022-03-14 Mon 11:50]--[2022-03-14 Mon 12:55] =>  1:05
CLOCK: [2022-03-14 Mon 11:25]--[2022-03-14 Mon 11:44] =>  0:19
CLOCK: [2022-03-14 Mon 10:54]--[2022-03-14 Mon 11:25] =>  0:31
CLOCK: [2022-03-14 Mon 02:53]--[2022-03-14 Mon 03:37] =>  0:44
CLOCK: [2022-03-14 Mon 02:48]--[2022-03-14 Mon 02:53] =>  0:05
CLOCK: [2022-03-14 Mon 02:41]--[2022-03-14 Mon 02:48] =>  0:07
CLOCK: [2022-03-14 Mon 01:39]--[2022-03-14 Mon 02:40] =>  1:01
CLOCK: [2022-03-14 Mon 00:01]--[2022-03-14 Mon 00:17] =>  0:16
CLOCK: [2022-03-13 Sun 23:29]--[2022-03-13 Sun 23:58] =>  0:29
CLOCK: [2022-03-13 Sun 22:56]--[2022-03-13 Sun 23:28] =>  0:32
CLOCK: [2022-03-13 Sun 22:50]--[2022-03-13 Sun 22:55] =>  0:05
CLOCK: [2022-03-13 Sun 21:51]--[2022-03-13 Sun 22:24] =>  0:33
CLOCK: [2022-03-04 Fri 16:02]--[2022-03-04 Fri 16:27] =>  0:25
:END:
**** with Dr Zhu for Weekly progress report on PhD. Monday 2pm :CANCELLED:
:PROPERTIES:
:LAST_REPEAT: [2022-05-05 Thu 02:16]
:END:
:PROPERTIES:
:LAST_REPEAT: [2022-02-28 Mon 16:53]
:END:
:LOGBOOK:
- State "CANCELLED"  from              [2022-05-05 Thu 02:16] \\
  somethink
- State "CANCELLED"  from              [2022-05-05 Thu 02:16]
- State "CANCELLED"  from              [2022-05-05 Thu 02:16]
- State "DONE"       from "TODO"       [2022-02-28 Mon 16:53]
- State "MEETING"    from "TODO"       [2022-02-27 Sun 12:00]
- State "DONE"       from "TODO"       [2022-02-27 Sun 12:00]
CLOCK: [2022-02-24 Thu 13:54]--[2022-02-24 Thu 14:41] =>  0:47
:END:
[2022-02-24 Thu 13:54]
******* waiting on the following run from koko
#+BEGIN_SRC sh
# log name is 1645725664.4413369
/mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3 train_self_supervised.py -d reddit_10000 --use_memory --n_runs 1 --n_epoch 5 --bs 200  --ws_framework ensemble --custom_prefix tmp --ws_multiplier 1 --init_n_instances_as_multiple_of_ws 10

# log name is 1645728678.546848
/mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3 train_self_supervised.py -d reddit_10000 --use_memory --n_runs 1 --n_epoch 5 --bs 200  --ws_framework ensemble --custom_prefix tmp --ws_multiplier 1 --init_n_instances_as_multiple_of_ws 10 --fix_begin_data_ind_of_models_in_ensemble
#+END_SRC

#+RESULTS:
|              |    |                                                                 |     |                                                                 |     |       |
| /usr/bin/sh: | 1: | /mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3: | not | found                                                           |     |       |
| $            |  $ | /usr/bin/sh:                                                    |  4: | /mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3: | not | found |

******* fix error in sliding_window :PhD:
Traceback (most recent call last):
  File "<string>", line 1, in <module>
NameError: name 'weight_observer_path' is not defined
:LOGBOOK:
CLOCK: [2022-02-22 Tue 15:23]--[2022-02-22 Tue 15:24] =>  0:01
:END:
[2022-02-22 Tue 15:23]
[[file:/mnt/c/Users/terng/OneDrive/Documents/Working/tgn/evaluation/sliding_window.py::pd.DataFrame.from_dict(observer).to_pickle( str(weight_observer_path /weight_observer_file_name))]]
******* make node classification work with the model. :@PhD:PhD:
:LOGBOOK:
CLOCK: [2022-02-24 Thu 00:33]--[2022-02-24 Thu 00:34] =>  0:01
:END:
[2022-02-24 Thu 00:33]
[[file:~/org/notes/emacs/packages/tramp-note.org::*tramp is buggy and freeze alot.][tramp is buggy and freeze alot.]]
*****  how to send command via ssh to remote server?
:LOGBOOK:
CLOCK: [2022-02-28 Mon 08:55]--[2022-02-28 Mon 08:57] =>  0:02
:END:
[2022-02-28 Mon 08:55]
[[file:~/org/PhD.org::*waiting on the following run from koko][waiting on the following run from koko]]
